MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F452JEUB/mcu.h
    /* DCU */
    EVT_SRC_DCU1                = 55U,      /* DCU1 */
    EVT_SRC_DCU2                = 56U,      /* DCU2 */
    EVT_SRC_DCU3                = 57U,      /* DCU3 */
    EVT_SRC_DCU4                = 58U,      /* DCU4 */

    /* TIMER 0 */
    EVT_SRC_TMR0_1_CMP_A        = 64U,      /* TMR01_GCMA */
    EVT_SRC_TMR0_1_CMP_B        = 65U,      /* TMR01_GCMB */
    EVT_SRC_TMR0_2_CMP_A        = 66U,      /* TMR02_GCMA */
    EVT_SRC_TMR0_2_CMP_B        = 67U,      /* TMR02_GCMB */

    /* RTC */
    EVT_SRC_RTC_ALM             = 81U,      /* RTC_ALM */
    EVT_SRC_RTC_PRD             = 82U,      /* RTC_PRD */

    /* TIMER 6 */
    EVT_SRC_TMR6_1_GCMP_A       = 96U,      /* TMR61_GCMA */
    EVT_SRC_TMR6_1_GCMP_B       = 97U,      /* TMR61_GCMB */
    EVT_SRC_TMR6_1_GCMP_C       = 98U,      /* TMR61_GCMC */
    EVT_SRC_TMR6_1_GCMP_D       = 99U,      /* TMR61_GCMD */
    EVT_SRC_TMR6_1_GCMP_E       = 100U,     /* TMR61_GCME */
    EVT_SRC_TMR6_1_GCMP_F       = 101U,     /* TMR61_GCMF */
    EVT_SRC_TMR6_1_OVF          = 102U,     /* TMR61_GOVF */
    EVT_SRC_TMR6_1_UDF          = 103U,     /* TMR61_GUDF */
    EVT_SRC_TMR6_1_SCMP_A       = 107U,     /* TMR61_SCMA */
    EVT_SRC_TMR6_1_SCMP_B       = 108U,     /* TMR61_SCMB */
    EVT_SRC_TMR6_2_GCMP_A       = 112U,     /* TMR62_GCMA */
    EVT_SRC_TMR6_2_GCMP_B       = 113U,     /* TMR62_GCMB */
    EVT_SRC_TMR6_2_GCMP_C       = 114U,     /* TMR62_GCMC */
    EVT_SRC_TMR6_2_GCMP_D       = 115U,     /* TMR62_GCMD */
    EVT_SRC_TMR6_2_GCMP_E       = 116U,     /* TMR62_GCME */
    EVT_SRC_TMR6_2_GCMP_F       = 117U,     /* TMR62_GCMF */
    EVT_SRC_TMR6_2_OVF          = 118U,     /* TMR62_GOVF */
    EVT_SRC_TMR6_2_UDF          = 119U,     /* TMR62_GUDF */
    EVT_SRC_TMR6_2_SCMP_A       = 123U,     /* TMR62_SCMA */
    EVT_SRC_TMR6_2_SCMP_B       = 124U,     /* TMR62_SCMB */
    EVT_SRC_TMR6_3_GCMP_A       = 128U,     /* TMR63_GCMA */
    EVT_SRC_TMR6_3_GCMP_B       = 129U,     /* TMR63_GCMB */
    EVT_SRC_TMR6_3_GCMP_C       = 130U,     /* TMR63_GCMC */
    EVT_SRC_TMR6_3_GCMP_D       = 131U,     /* TMR63_GCMD */
    EVT_SRC_TMR6_3_GCMP_E       = 132U,     /* TMR63_GCME */
    EVT_SRC_TMR6_3_GCMP_F       = 133U,     /* TMR63_GCMF */
    EVT_SRC_TMR6_3_OVF          = 134U,     /* TMR63_GOVF */
    EVT_SRC_TMR6_3_UDF          = 135U,     /* TMR63_GUDF */
    EVT_SRC_TMR6_3_SCMP_A       = 139U,     /* TMR63_SCMA */
    EVT_SRC_TMR6_3_SCMP_B       = 140U,     /* TMR63_SCMB */

    /* TIMER A */
    EVT_SRC_TMRA_1_OVF          = 256U,     /* TMRA1_OVF */
    EVT_SRC_TMRA_1_UDF          = 257U,     /* TMRA1_UDF */
    EVT_SRC_TMRA_1_CMP          = 258U,     /* TMRA1_CMP */
    EVT_SRC_TMRA_2_OVF          = 259U,     /* TMRA2_OVF */
    EVT_SRC_TMRA_2_UDF          = 260U,     /* TMRA2_UDF */
    EVT_SRC_TMRA_2_CMP          = 261U,     /* TMRA2_CMP */
    EVT_SRC_TMRA_3_OVF          = 262U,     /* TMRA3_OVF */
    EVT_SRC_TMRA_3_UDF          = 263U,     /* TMRA3_UDF */
    EVT_SRC_TMRA_3_CMP          = 264U,     /* TMRA3_CMP */
    EVT_SRC_TMRA_4_OVF          = 265U,     /* TMRA4_OVF */
    EVT_SRC_TMRA_4_UDF          = 266U,     /* TMRA4_UDF */
    EVT_SRC_TMRA_4_CMP          = 267U,     /* TMRA4_CMP */
    EVT_SRC_TMRA_5_OVF          = 268U,     /* TMRA5_OVF */
    EVT_SRC_TMRA_5_UDF          = 269U,     /* TMRA5_UDF */
    EVT_SRC_TMRA_5_CMP          = 270U,     /* TMRA5_CMP */
    EVT_SRC_TMRA_6_OVF          = 272U,     /* TMRA6_OVF */
    EVT_SRC_TMRA_6_UDF          = 273U,     /* TMRA6_UDF */
    EVT_SRC_TMRA_6_CMP          = 274U,     /* TMRA6_CMP */

    /* USART */
    EVT_SRC_USART1_EI           = 278U,     /* USART1_EI  */
    EVT_SRC_USART1_RI           = 279U,     /* USART1_RI  */
    EVT_SRC_USART1_TI           = 280U,     /* USART1_TI  */
    EVT_SRC_USART1_TCI          = 281U,     /* USART1_TCI */
    EVT_SRC_USART1_RTO          = 282U,     /* USART1_RTO */
    EVT_SRC_USART2_EI           = 283U,     /* USART2_EI  */
    EVT_SRC_USART2_RI           = 284U,     /* USART2_RI  */
    EVT_SRC_USART2_TI           = 285U,     /* USART2_TI  */
    EVT_SRC_USART2_TCI          = 286U,     /* USART2_TCI */
    EVT_SRC_USART2_RTO          = 287U,     /* USART2_RTO */
    EVT_SRC_USART3_EI           = 288U,     /* USART3_EI  */
    EVT_SRC_USART3_RI           = 289U,     /* USART3_RI  */
    EVT_SRC_USART3_TI           = 290U,     /* USART3_TI  */
    EVT_SRC_USART3_TCI          = 291U,     /* USART3_TCI */
    EVT_SRC_USART3_RTO          = 292U,     /* USART3_RTO */
    EVT_SRC_USART4_EI           = 293U,     /* USART4_EI  */
    EVT_SRC_USART4_RI           = 294U,     /* USART4_RI  */
    EVT_SRC_USART4_TI           = 295U,     /* USART4_TI  */
    EVT_SRC_USART4_TCI          = 296U,     /* USART4_TCI */
    EVT_SRC_USART4_RTO          = 297U,     /* USART4_RTO */

    /* SPI */
    EVT_SRC_SPI1_SPRI           = 299U,     /* SPI1_SPRI   */
    EVT_SRC_SPI1_SPTI           = 300U,     /* SPI1_SPTI   */
    EVT_SRC_SPI1_SPII           = 301U,     /* SPI1_SPII   */
    EVT_SRC_SPI1_SPEI           = 302U,     /* SPI1_SPEI   */
    EVT_SRC_SPI1_SPTEND         = 303U,     /* SPI1_SPTEND */
    EVT_SRC_SPI2_SPRI           = 304U,     /* SPI2_SPRI   */
    EVT_SRC_SPI2_SPTI           = 305U,     /* SPI2_SPTI   */
    EVT_SRC_SPI2_SPII           = 306U,     /* SPI2_SPII   */
    EVT_SRC_SPI2_SPEI           = 307U,     /* SPI2_SPEI   */
    EVT_SRC_SPI2_SPTEND         = 308U,     /* SPI2_SPTEND */
    EVT_SRC_SPI3_SPRI           = 309U,     /* SPI3_SPRI   */
    EVT_SRC_SPI3_SPTI           = 310U,     /* SPI3_SPTI   */
    EVT_SRC_SPI3_SPII           = 311U,     /* SPI3_SPII   */
    EVT_SRC_SPI3_SPEI           = 312U,     /* SPI3_SPEI   */
    EVT_SRC_SPI3_SPTEND         = 313U,     /* SPI3_SPTEND */
    EVT_SRC_SPI4_SPRI           = 314U,     /* SPI4_SPRI   */
    EVT_SRC_SPI4_SPTI           = 315U,     /* SPI4_SPTI   */
    EVT_SRC_SPI4_SPII           = 316U,     /* SPI4_SPII   */
    EVT_SRC_SPI4_SPEI           = 317U,     /* SPI4_SPEI   */
    EVT_SRC_SPI4_SPTEND         = 318U,     /* SPI4_SPTEND */

    /* AOS */
    EVT_SRC_AOS_STRG            = 319U,     /* AOS_STRG */

    /* TIMER 4 */
    EVT_SRC_TMR4_1_SCMP0        = 368U,     /* TMR41_SCM0 */
    EVT_SRC_TMR4_1_SCMP1        = 369U,     /* TMR41_SCM1 */
    EVT_SRC_TMR4_1_SCMP2        = 370U,     /* TMR41_SCM2 */
    EVT_SRC_TMR4_1_SCMP3        = 371U,     /* TMR41_SCM3 */
    EVT_SRC_TMR4_1_SCMP4        = 372U,     /* TMR41_SCM4 */
    EVT_SRC_TMR4_1_SCMP5        = 373U,     /* TMR41_SCM5 */
    EVT_SRC_TMR4_2_SCMP0        = 374U,     /* TMR42_SCM0 */
    EVT_SRC_TMR4_2_SCMP1        = 375U,     /* TMR42_SCM1 */
    EVT_SRC_TMR4_2_SCMP2        = 376U,     /* TMR42_SCM2 */
    EVT_SRC_TMR4_2_SCMP3        = 377U,     /* TMR42_SCM3 */
    EVT_SRC_TMR4_2_SCMP4        = 378U,     /* TMR42_SCM4 */
    EVT_SRC_TMR4_2_SCMP5        = 379U,     /* TMR42_SCM5 */
    EVT_SRC_TMR4_3_SCMP0        = 384U,     /* TMR43_SCM0 */
    EVT_SRC_TMR4_3_SCMP1        = 385U,     /* TMR43_SCM1 */
    EVT_SRC_TMR4_3_SCMP2        = 386U,     /* TMR43_SCM2 */
    EVT_SRC_TMR4_3_SCMP3        = 387U,     /* TMR43_SCM3 */
    EVT_SRC_TMR4_3_SCMP4        = 388U,     /* TMR43_SCM4 */
    EVT_SRC_TMR4_3_SCMP5        = 389U,     /* TMR43_SCM5 */

    /* EVENT PORT */
    EVT_SRC_EVENT_PORT1         = 394U,     /* EVENT_PORT1 */
    EVT_SRC_EVENT_PORT2         = 395U,     /* EVENT_PORT2 */
    EVT_SRC_EVENT_PORT3         = 396U,     /* EVENT_PORT3 */
    EVT_SRC_EVENT_PORT4         = 397U,     /* EVENT_PORT4 */

    /* I2S */
    EVT_SRC_I2S1_TXIRQOUT       = 400U,     /* I2S1_TXIRQOUT */
    EVT_SRC_I2S1_RXIRQOUT       = 401U,     /* I2S1_RXIRQOUT */
    EVT_SRC_I2S2_TXIRQOUT       = 403U,     /* I2S2_TXIRQOUT */
    EVT_SRC_I2S2_RXIRQOUT       = 404U,     /* I2S2_RXIRQOUT */
    EVT_SRC_I2S3_TXIRQOUT       = 406U,     /* I2S3_TXIRQOUT */
    EVT_SRC_I2S3_RXIRQOUT       = 407U,     /* I2S3_RXIRQOUT */
    EVT_SRC_I2S4_TXIRQOUT       = 409U,     /* I2S4_TXIRQOUT */
    EVT_SRC_I2S4_RXIRQOUT       = 410U,     /* I2S4_RXIRQOUT */

    /* COMPARATOR */
    EVT_SRC_CMP1                = 416U,     /* ACMP1 */
    EVT_SRC_CMP2                = 417U,     /* ACMP1 */
    EVT_SRC_CMP3                = 418U,     /* ACMP1 */

    /* I2C */
    EVT_SRC_I2C1_RXI            = 420U,     /* I2C1_RXI */
    EVT_SRC_I2C1_TXI            = 421U,     /* I2C1_TXI */
    EVT_SRC_I2C1_TEI            = 422U,     /* I2C1_TEI */
    EVT_SRC_I2C1_EEI            = 423U,     /* I2C1_EEI */
    EVT_SRC_I2C2_RXI            = 424U,     /* I2C2_RXI */
    EVT_SRC_I2C2_TXI            = 425U,     /* I2C2_TXI */
    EVT_SRC_I2C2_TEI            = 426U,     /* I2C2_TEI */
    EVT_SRC_I2C2_EEI            = 427U,     /* I2C2_EEI */
    EVT_SRC_I2C3_RXI            = 428U,     /* I2C3_RXI */
    EVT_SRC_I2C3_TXI            = 429U,     /* I2C3_TXI */
    EVT_SRC_I2C3_TEI            = 430U,     /* I2C3_TEI */
    EVT_SRC_I2C3_EEI            = 431U,     /* I2C3_EEI */

    /* LVD */
    EVT_SRC_LVD1                = 433U,     /* LVD1 */
    EVT_SRC_LVD2                = 434U,     /* LVD2 */

    /* OTS */
    EVT_SRC_OTS                 = 435U,     /* OTS */

