MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F452JEUB/mcu.h
/*  Bit definition for ADC_ICR register  */
#define ADC_ICR_EOCAIEN_POS                            (0U)
#define ADC_ICR_EOCAIEN                                (0x01U)
#define ADC_ICR_EOCBIEN_POS                            (1U)
#define ADC_ICR_EOCBIEN                                (0x02U)

/*  Bit definition for ADC_SYNCCR register  */
#define ADC_SYNCCR_SYNCEN_POS                          (0U)
#define ADC_SYNCCR_SYNCEN                              (0x0001U)
#define ADC_SYNCCR_SYNCMD_POS                          (4U)
#define ADC_SYNCCR_SYNCMD                              (0x0070U)
#define ADC_SYNCCR_SYNCDLY_POS                         (8U)
#define ADC_SYNCCR_SYNCDLY                             (0xFF00U)

/*  Bit definition for ADC_DR0 register  */
#define ADC_DR0                                        (0xFFFFU)

/*  Bit definition for ADC_DR1 register  */
#define ADC_DR1                                        (0xFFFFU)

/*  Bit definition for ADC_DR2 register  */
#define ADC_DR2                                        (0xFFFFU)

/*  Bit definition for ADC_DR3 register  */
#define ADC_DR3                                        (0xFFFFU)

/*  Bit definition for ADC_DR4 register  */
#define ADC_DR4                                        (0xFFFFU)

/*  Bit definition for ADC_DR5 register  */
#define ADC_DR5                                        (0xFFFFU)

/*  Bit definition for ADC_DR6 register  */
#define ADC_DR6                                        (0xFFFFU)

/*  Bit definition for ADC_DR7 register  */
#define ADC_DR7                                        (0xFFFFU)

/*  Bit definition for ADC_DR8 register  */
#define ADC_DR8                                        (0xFFFFU)

/*  Bit definition for ADC_DR9 register  */
#define ADC_DR9                                        (0xFFFFU)

/*  Bit definition for ADC_DR10 register  */
#define ADC_DR10                                       (0xFFFFU)

/*  Bit definition for ADC_DR11 register  */
#define ADC_DR11                                       (0xFFFFU)

/*  Bit definition for ADC_DR12 register  */
#define ADC_DR12                                       (0xFFFFU)

/*  Bit definition for ADC_DR13 register  */
#define ADC_DR13                                       (0xFFFFU)

/*  Bit definition for ADC_DR14 register  */
#define ADC_DR14                                       (0xFFFFU)

/*  Bit definition for ADC_DR15 register  */
#define ADC_DR15                                       (0xFFFFU)

/*  Bit definition for ADC_DR16 register  */
#define ADC_DR16                                       (0xFFFFU)

/*  Bit definition for ADC_AWDCR register  */
#define ADC_AWDCR_AWDEN_POS                            (0U)
#define ADC_AWDCR_AWDEN                                (0x0001U)
#define ADC_AWDCR_AWDMD_POS                            (4U)
#define ADC_AWDCR_AWDMD                                (0x0010U)
#define ADC_AWDCR_AWDSS_POS                            (6U)
#define ADC_AWDCR_AWDSS                                (0x00C0U)
#define ADC_AWDCR_AWDSS_0                              (0x0040U)
#define ADC_AWDCR_AWDSS_1                              (0x0080U)
#define ADC_AWDCR_AWDIEN_POS                           (8U)
#define ADC_AWDCR_AWDIEN                               (0x0100U)

/*  Bit definition for ADC_AWDDR0 register  */
#define ADC_AWDDR0                                     (0xFFFFU)

/*  Bit definition for ADC_AWDDR1 register  */
#define ADC_AWDDR1                                     (0xFFFFU)

/*  Bit definition for ADC_AWDCHSR register  */
#define ADC_AWDCHSR_AWDCH                              (0x0001FFFFUL)

/*  Bit definition for ADC_AWDSR register  */
#define ADC_AWDSR_AWDF                                 (0x0001FFFFUL)

/*  Bit definition for ADC_PGACR register  */
#define ADC_PGACR_PGACTL                               (0x000FU)

/*  Bit definition for ADC_PGAGSR register  */
#define ADC_PGAGSR_GAIN                                (0x000FU)

/*  Bit definition for ADC_PGAINSR0 register  */
#define ADC_PGAINSR0_PGAINSEL                          (0x01FFU)
#define ADC_PGAINSR0_PGAINSEL_0                        (0x0001U)
#define ADC_PGAINSR0_PGAINSEL_1                        (0x0002U)
#define ADC_PGAINSR0_PGAINSEL_2                        (0x0004U)
#define ADC_PGAINSR0_PGAINSEL_3                        (0x0008U)
#define ADC_PGAINSR0_PGAINSEL_4                        (0x0010U)
#define ADC_PGAINSR0_PGAINSEL_5                        (0x0020U)
#define ADC_PGAINSR0_PGAINSEL_6                        (0x0040U)
#define ADC_PGAINSR0_PGAINSEL_7                        (0x0080U)
#define ADC_PGAINSR0_PGAINSEL_8                        (0x0100U)

/*  Bit definition for ADC_PGAINSR1 register  */
#define ADC_PGAINSR1_PGAVSSEN                          (0x0001U)

/*******************************************************************************
                Bit definition for Peripheral AES
*******************************************************************************/
/*  Bit definition for AES_CR register  */
#define AES_CR_START_POS                               (0U)
#define AES_CR_START                                   (0x00000001UL)
#define AES_CR_MODE_POS                                (1U)
#define AES_CR_MODE                                    (0x00000002UL)

/*  Bit definition for AES_DR0 register  */
#define AES_DR0                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_DR1 register  */
#define AES_DR1                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_DR2 register  */
#define AES_DR2                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_DR3 register  */
#define AES_DR3                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_KR0 register  */
#define AES_KR0                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_KR1 register  */
#define AES_KR1                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_KR2 register  */
#define AES_KR2                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_KR3 register  */
#define AES_KR3                                        (0xFFFFFFFFUL)

